**Importing all the necessary libraries**

In [33]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

**Reading the Excel file and drawing a rough overview of the data**

In [3]:
df=pd.read_excel("/content/Data Analyst - Test Data.xlsx")
copy=df
copy.head()

                                              Review       date     Location
0  I was very impressed with the resort.\n Great ... 2019-08-20    Sebastian
1  The rooms were nice the outside needs work als... 2019-08-20  Los Angeles
2  Great location! I have stayed at this hotel on... 2019-08-20      Georgia
3  The hotel was adequate for my stay. The strips... 2019-08-20          NaN
4  Great location, room was large and spacious. P... 2019-08-19  Palm Harbor

**Checking the Shape of the data(rows and columns)**

In [6]:
copy.shape

(6448, 3)

***The describe() method is used for calculating some statistical data like percentile, mean and std of the numerical values of the Series or DataFrame. It analyzes both numeric and object series and also the DataFrame column sets of mixed data types***

In [8]:
copy.describe()

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: FutureWarning: Treating datetime data as categorical rather than numeric in `.describe` is deprecated and will be removed in a future version of pandas. Specify `datetime_is_numeric=True` to silence this warning and adopt the future behavior now.
  """Entry point for launching an IPython kernel.

                                       Review  ...                  Location
count                                    6393  ...                      1711
unique                                   6384  ...                      1082
top     Amazing\n  \n  Read more\n  Read less  ...  United States of America
freq                                        4  ...                       116
first                                     NaN  ...                       NaN
last                                      NaN  ...                       NaN

[6 rows x 3 columns]

**Checking for NULL values by using isnull() fuction and geting the sum of null values of each columns by sum() function**

In [9]:
copy.isnull().sum()

Review        55
date           0
Location    4737
dtype: int64

In [11]:
copy['Location'].describe()

count                         1711
unique                        1082
top       United States of America
freq                           116
Name: Location, dtype: object

**Dropping all the NULL values to reduce the redundancy. Here we are dropping the data because we cant assume any value for any of the columns**

In [16]:
copy.dropna(inplace=True)

In [17]:
copy.isnull().sum()

Review      0
date        0
Location    0
dtype: int64

In [19]:
copy.shape

(1705, 3)

In [68]:
copy['Location'].value_counts(sort=True,ascending=False)

United States of America    116
New York                     34
California                   19
San Jose                     19
Florida                      16
                           ...
Busan, Korea                  1
Cincinnati                    1
Dayton us                     1
Terral, OK                    1
huntington,NY                 1
Name: Location, Length: 1078, dtype: int64

**Conclusion: By analysing this we can say maximum number of of reviews are from United States of America**

In [69]:
copy['date'].value_counts(sort=True,ascending=False)

2018-09-04    18
2019-07-31    17
2019-08-11    16
2018-11-26    15
2018-10-26    14
              ..
2019-04-10     1
2019-05-03     1
2019-06-06     1
2019-01-22     1
2018-12-21     1
Name: date, Length: 363, dtype: int64

**Conclusion: By analysing this we can say maximum number of reviews came on 2018-09-04**

This analysis is done by **Supriyo Pal**

Linked in profile :- https://www.linkedin.com/in/supriyo-pal-0a7b03159/